---
title: Wood
classe: Autodesk.Revit.DB.Visual.Wood
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# Wood

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String TextureAngle { get; }` | `Wood.TextureAngle` | String |
| `String TextureLinkTextureTransforms { get; }` | `Wood.TextureLinkTextureTransforms` | String |
| `String TextureRealWorldOffsetX { get; }` | `Wood.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `Wood.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldOffsetZ { get; }` | `Wood.TextureRealWorldOffsetZ` | String |
| `String WoodAxialNoise { get; }` | `Wood.WoodAxialNoise` | String |
| `String WoodColor1 { get; }` | `Wood.WoodColor1` | String |
| `String WoodColor2 { get; }` | `Wood.WoodColor2` | String |
| `String WoodRadialNoise { get; }` | `Wood.WoodRadialNoise` | String |
| `String WoodThickness { get; }` | `Wood.WoodThickness` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```